# -*- coding: utf-8 -*-
"""
Напишите программу, которая печатает сумму чисел от 1 до 101 (включены 1 и 101)
Которые делятся на 5 (используйте цикл while)
Ответ: 1050
"""
# def sumer_numb():
#    pass
"""
i = 0
while i <= 101:
	print(i)
	i+= 1
print("Finished")
#vivod 1 2 3 4 5 6 Finished
=============
i = 0
while True:
	i = i + 1
	if i == 2:
		print("Skipping 2")
		continue
	if i == 5:
		print("Breaking")
		break
	print(i)
print("Finished")
#1
#Skipping 2
#3
#4
#Breaking
#Finished


"""
#Напишите программу, которая печатает сумму чисел от 1 до 25
#Которые делятся на 5 (используйте цикл while)
#Ответ: 75

#i = 5 + 10 + 15 + 20 + 25
#i == 75

i = 1
while i <= 75:
    if i % 5 == 0
    print(i)
    i=i + 1

print("Finished")
#vivod 1 2 3 4 5 6 Finished




assert 5 + 10 + 15 + 20 + 25 == 75
#assert i == 75